Revit 2027 API
IFCHybridImport.CreateMap Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<IFCGuidKey, ElementId> CreateMap(
	Document doc,
	IList<ElementId> elementIds
)
Public Function CreateMap (
	doc As Document,
	elementIds As IList(Of ElementId)
) As IDictionary(Of IFCGuidKey, ElementId)
public:
IDictionary<IFCGuidKey^, ElementId^>^ CreateMap(
	Document^ doc,
	IList<ElementId^>^ elementIds
)
member CreateMap :
        doc : Document *
        elementIds : IList<ElementId> -> IDictionary<IFCGuidKey, ElementId>
Parameters
doc Document
elementIds IList<ElementId>
Return Value
IDictionary<IFCGuidKey, ElementId>
See Also
Reference
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace